<a href="https://colab.research.google.com/github/Ganapathi-tech/ganapathi-tech-Ganesh/blob/main/pandas_concat2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
d1 = {
    "city" : ["Hyd","Che","Blr","Viz"],
    "Temp" : [35,40,37,38],
    "Humd" : [45,50,47,52]
}

d2 = {
    "city" : ["Del","Chgd","Lnow","Jpur"],
    "Temp" : [34,36,38,40],
    "Humd" : [45,48,47,50]
}

scity = pd.DataFrame(d1)
ncity = pd.DataFrame(d2)

In [ ]:
scity = pd.DataFrame(d1)
ncity = pd.DataFrame(d2)

In [ ]:
scity

  city  Temp  Humd
0  Hyd    35    45
1  Che    40    50
2  Blr    37    47
3  Viz    38    52

In [ ]:
ncity

   city  Temp  Humd
0   Del    34    45
1  Chgd    36    48
2  Lnow    38    47
3  Jpur    40    50

In [ ]:
df_gi =  pd.concat([scity, ncity], ignore_index=True)

In [ ]:
df1

   city  Temp  Humd
0   Hyd    35    45
1   Che    40    50
2   Blr    37    47
3   Viz    38    52
0   Del    34    45
1  Chgd    36    48
2  Lnow    38    47
3  Jpur    40    50

In [ ]:
df1.city

0     Hyd
1     Che
2     Blr
3     Viz
0     Del
1    Chgd
2    Lnow
3    Jpur
Name: city, dtype: object

In [ ]:
df1.Temp

0    35
1    40
2    37
3    38
0    34
1    36
2    38
3    40
Name: Temp, dtype: int64

In [ ]:
df1.Humd

0    45
1    50
2    47
3    52
0    45
1    48
2    47
3    50
Name: Humd, dtype: int64

In [ ]:
df1

   city  Temp  Humd
0   Hyd    35    45
1   Che    40    50
2   Blr    37    47
3   Viz    38    52
0   Del    34    45
1  Chgd    36    48
2  Lnow    38    47
3  Jpur    40    50

In [ ]:
df1.iloc[5]

city    Chgd
Temp      36
Humd      48
Name: 1, dtype: object

In [ ]:
df_gi

   city  Temp  Humd
0   Hyd    35    45
1   Che    40    50
2   Blr    37    47
3   Viz    38    52
4   Del    34    45
5  Chgd    36    48
6  Lnow    38    47
7  Jpur    40    50

In [ ]:
df1 = pd.concat([scity, ncity], keys=["South", "North"])

In [ ]:
df1

         city  Temp  Humd
South 0   Hyd    35    45
      1   Che    40    50
      2   Blr    37    47
      3   Viz    38    52
North 0   Del    34    45
      1  Chgd    36    48
      2  Lnow    38    47
      3  Jpur    40    50

In [ ]:
df1.loc["South"]

  city  Temp  Humd
0  Hyd    35    45
1  Che    40    50
2  Blr    37    47
3  Viz    38    52

In [ ]:
df1.loc["North"]

   city  Temp  Humd
0   Del    34    45
1  Chgd    36    48
2  Lnow    38    47
3  Jpur    40    50

In [ ]:
df_gi

   city  Temp  Humd
0   Hyd    35    45
1   Che    40    50
2   Blr    37    47
3   Viz    38    52
4   Del    34    45
5  Chgd    36    48
6  Lnow    38    47
7  Jpur    40    50

In [ ]:
df_gi.Temp.max()

40

In [ ]:
df_gi["Temp"] == df_gi.Temp.max()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
Name: Temp, dtype: bool

In [ ]:
df_gi[df_gi["Temp"] == df_gi.Temp.max()]

   city  Temp  Humd
1   Che    40    50
7  Jpur    40    50

In [ ]:
df1

         city  Temp  Humd
South 0   Hyd    35    45
      1   Che    40    50
      2   Blr    37    47
      3   Viz    38    52
North 0   Del    34    45
      1  Chgd    36    48
      2  Lnow    38    47
      3  Jpur    40    50

In [ ]:
dfaxis1 = pd.concat([scity, ncity], keys=["South", "North"], axis = 1)

In [ ]:
dfaxis1

  South           North
   city Temp Humd  city Temp Humd
0   Hyd   35   45   Del   34   45
1   Che   40   50  Chgd   36   48
2   Blr   37   47  Lnow   38   47
3   Viz   38   52  Jpur   40   50

In [ ]:
df1

         city  Temp  Humd
South 0   Hyd    35    45
      1   Che    40    50
      2   Blr    37    47
      3   Viz    38    52
North 0   Del    34    45
      1  Chgd    36    48
      2  Lnow    38    47
      3  Jpur    40    50

In [ ]:
s1 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "Q1" : [75,85,76,65],
    "Q2" : [65,87,69,73],
}

s2 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "Q3" : [62,88,72,78],
    "Q4" : [66,84,74,70],
}


dfs1 = pd.DataFrame(s1)
dfs2 = pd.DataFrame(s2)

In [ ]:
dfs1

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73

In [ ]:
dfs2

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70

In [ ]:
scity

  city  Temp  Humd
0  Hyd    35    45
1  Che    40    50
2  Blr    37    47
3  Viz    38    52

In [ ]:
ncity

   city  Temp  Humd
0   Del    34    45
1  Chgd    36    48
2  Lnow    38    47
3  Jpur    40    50

In [ ]:
pd.concat([dfs1, dfs2])

     Name    Q1    Q2    Q3    Q4
0    Henk  75.0  65.0   NaN   NaN
1  Shanti  85.0  87.0   NaN   NaN
2   Shiva  76.0  69.0   NaN   NaN
3   Kumar  65.0  73.0   NaN   NaN
0    Henk   NaN   NaN  62.0  66.0
1  Shanti   NaN   NaN  88.0  84.0
2   Shiva   NaN   NaN  72.0  74.0
3   Kumar   NaN   NaN  78.0  70.0

In [ ]:
pd.concat([dfs1,dfs2], axis = 1)

     Name  Q1  Q2    Name  Q3  Q4
0    Henk  75  65    Henk  62  66
1  Shanti  85  87  Shanti  88  84
2   Shiva  76  69   Shiva  72  74
3   Kumar  65  73   Kumar  78  70

In [ ]:
dfs1

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73

In [ ]:
dfs1 = dfs1.set_index("Name")

In [ ]:
dfs1

        Q1  Q2
Name
Henk    75  65
Shanti  85  87
Shiva   76  69
Kumar   65  73

In [ ]:
dfs2

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70

In [ ]:
dfs2 = dfs2.set_index("Name")

In [ ]:
dfs2

        Q3  Q4
Name
Henk    62  66
Shanti  88  84
Shiva   72  74
Kumar   78  70

In [ ]:
dfs1

        Q1  Q2
Name
Henk    75  65
Shanti  85  87
Shiva   76  69
Kumar   65  73

In [ ]:
dfs2

        Q3  Q4
Name
Henk    62  66
Shanti  88  84
Shiva   72  74
Kumar   78  70

In [ ]:
std_concat = pd.concat([dfs1, dfs2], axis = 1)

In [ ]:
std_concat

        Q1  Q2  Q3  Q4
Name
Henk    75  65  62  66
Shanti  85  87  88  84
Shiva   76  69  72  74
Kumar   65  73  78  70

In [ ]:
std_concat["Average"] = std_concat["Q1"]+ std_concat["Q2"]+std_concat["Q3"]+std_concat["Q4"]

In [ ]:
std_concat

        Q1  Q2  Q3  Q4  Average
Name
Henk    75  65  62  66      268
Shanti  85  87  88  84      344
Shiva   76  69  72  74      291
Kumar   65  73  78  70      286

In [ ]:
std_concat.to_csv("Student.csv")

In [ ]:
d1 = {
    "city" : ["Hyd","Che","Blr","Viz"],
    "Temp" : [35,40,37,38],
    "Humd" : [45,50,47,52]
}

d2 = {
    "city" : ["Del","Chgd","Lnow","Jpur"],
    "Temp" : [34,36,38,40],
    "Humd" : [45,48,47,50]
}

scity = pd.DataFrame(d1)
ncity = pd.DataFrame(d2)

# PANDAS MERGE FUNCTION

In [ ]:
s1 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "Q1" : [75,85,76,65],
    "Q2" : [65,87,69,73],
}

s2 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "Q3" : [62,88,72,78],
    "Q4" : [66,84,74,70],
}


dfs1 = pd.DataFrame(s1)
dfs2 = pd.DataFrame(s2)

In [ ]:
dfs1

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73

In [ ]:
dfs2

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70

In [ ]:
pd.concat([dfs1, dfs2], axis = 1)

     Name  Q1  Q2    Name  Q3  Q4
0    Henk  75  65    Henk  62  66
1  Shanti  85  87  Shanti  88  84
2   Shiva  76  69   Shiva  72  74
3   Kumar  65  73   Kumar  78  70

In [ ]:
pd.concat([scity, ncity], axis = 1)

  city  Temp  Humd  city  Temp  Humd
0  Hyd    35    45   Del    34    45
1  Che    40    50  Chgd    36    48
2  Blr    37    47  Lnow    38    47
3  Viz    38    52  Jpur    40    50

In [ ]:
dfs1

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73

In [ ]:
dfs2

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70

In [ ]:
pd.merge(dfs1,dfs2, on = "Name")

     Name  Q1  Q2  Q3  Q4
0    Henk  75  65  62  66
1  Shanti  85  87  88  84
2   Shiva  76  69  72  74
3   Kumar  65  73  78  70

In [ ]:
pd.merge(dfs1, dfs2, on = "Name")

     Name  Q1  Q2  Q3  Q4
0    Henk  75  65  62  66
1  Shanti  85  87  88  84
2   Shiva  76  69  72  74
3   Kumar  65  73  78  70

In [ ]:
pd.merge(dfs1, dfs2)

     Name  Q1  Q2  Q3  Q4
0    Henk  75  65  62  66
1  Shanti  85  87  88  84
2   Shiva  76  69  72  74
3   Kumar  65  73  78  70

In [ ]:
s1 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "cls"  : [10, 10, 9, 9],
    "Q1" : [75,85,76,65],
    "Q2" : [65,87,69,73],
}

s2 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "cls"  : [10, 10, 9, 9],
    "Q3" : [62,88,72,78],
    "Q4" : [66,84,74,70],
}


dfs1 = pd.DataFrame(s1)
dfs2 = pd.DataFrame(s2)

In [ ]:
dfs1

     Name  cls  Q1  Q2
0    Henk   10  75  65
1  Shanti   10  85  87
2   Shiva    9  76  69
3   Kumar    9  65  73

In [ ]:
dfs2

     Name  cls  Q3  Q4
0    Henk   10  62  66
1  Shanti   10  88  84
2   Shiva    9  72  74
3   Kumar    9  78  70

In [ ]:
pd.merge(dfs1, dfs2)

     Name  cls  Q1  Q2  Q3  Q4
0    Henk   10  75  65  62  66
1  Shanti   10  85  87  88  84
2   Shiva    9  76  69  72  74
3   Kumar    9  65  73  78  70

In [ ]:
pd.merge(dfs1, dfs2, on = "Name")

     Name  cls_x  Q1  Q2  cls_y  Q3  Q4
0    Henk     10  75  65     10  62  66
1  Shanti     10  85  87     10  88  84
2   Shiva      9  76  69      9  72  74
3   Kumar      9  65  73      9  78  70

In [ ]:
s1 = {
    "Rno" : [111,222,333,444],
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "cls"  : [10, 10, 9, 9],
    "Q1" : [75,85,76,65],
    "Q2" : [65,87,69,73],
}

s2 = {
    "Rno" : [111,222,333,444],
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "cls"  : [10, 10, 9, 9],
    "Q3" : [62,88,72,78],
    "Q4" : [66,84,74,70],
}

sdf1 = pd.DataFrame(s1)
sdf2 = pd.DataFrame(s2)

In [ ]:
sdf1

   Rno    Name  cls  Q1  Q2
0  111    Henk   10  75  65
1  222  Shanti   10  85  87
2  333   Shiva    9  76  69
3  444   Kumar    9  65  73

In [ ]:
sdf2

   Rno    Name  cls  Q3  Q4
0  111    Henk   10  62  66
1  222  Shanti   10  88  84
2  333   Shiva    9  72  74
3  444   Kumar    9  78  70

In [ ]:
pd.merge(sdf1, sdf2)

   Rno    Name  cls  Q1  Q2  Q3  Q4
0  111    Henk   10  75  65  62  66
1  222  Shanti   10  85  87  88  84
2  333   Shiva    9  76  69  72  74
3  444   Kumar    9  65  73  78  70

In [ ]:
pd.merge(sdf1, sdf2, on = "Name")

   Rno_x    Name  cls_x  Q1  Q2  Rno_y  cls_y  Q3  Q4
0    111    Henk     10  75  65    111     10  62  66
1    222  Shanti     10  85  87    222     10  88  84
2    333   Shiva      9  76  69    333      9  72  74
3    444   Kumar      9  65  73    444      9  78  70

In [ ]:
pd.merge(sdf1, sdf2, on = "Name", suffixes=("_sem1", "_sem2"))

   Rno_sem1    Name  cls_sem1  Q1  Q2  Rno_sem2  cls_sem2  Q3  Q4
0       111    Henk        10  75  65       111        10  62  66
1       222  Shanti        10  85  87       222        10  88  84
2       333   Shiva         9  76  69       333         9  72  74
3       444   Kumar         9  65  73       444         9  78  70

In [ ]:
s1 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar"],
    "Q1" : [75,85,76,65],
    "Q2" : [65,87,69,73],
}

s2 = {
    "Name" : ["AAA","BBB","CCC","DDD"],
    "Q3" : [62,88,72,78],
    "Q4" : [66,84,74,70],
}


dfs3 = pd.DataFrame(s1)
dfs4 = pd.DataFrame(s2)

In [ ]:
dfs3

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73

In [ ]:
dfs4

  Name  Q3  Q4
0  AAA  62  66
1  BBB  88  84
2  CCC  72  74
3  DDD  78  70

In [ ]:
pd.merge(dfs3, dfs4)

Empty DataFrame
Columns: [Name, Q1, Q2, Q3, Q4]
Index: []

In [ ]:
pd.merge(dfs3, dfs4, left_index = True, right_index = True)

   Name_x  Q1  Q2 Name_y  Q3  Q4
0    Henk  75  65    AAA  62  66
1  Shanti  85  87    BBB  88  84
2   Shiva  76  69    CCC  72  74
3   Kumar  65  73    DDD  78  70

In [ ]:
s1 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar", "SKY", "SUN"],
    "Q1" : [75,85,76,65, 77, 81],
    "Q2" : [65,87,69,73, 69, 82],
}

s2 = {
    "Name" : ["Henk","Shanti","Shiva","Kumar", "AAA", "BBB"],
    "Q3" : [62,88,72,78,67,71],
    "Q4" : [66,84,74,70,78,77],
}


dfs5 = pd.DataFrame(s1)
dfs6 = pd.DataFrame(s2)

In [ ]:
dfs5

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73
4     SKY  77  69
5     SUN  81  82

In [ ]:
dfs6

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70
4     AAA  67  78
5     BBB  71  77

In [ ]:
pd.merge(dfs5, dfs6, on = "Name")

     Name  Q1  Q2  Q3  Q4
0    Henk  75  65  62  66
1  Shanti  85  87  88  84
2   Shiva  76  69  72  74
3   Kumar  65  73  78  70

In [ ]:
pd.merge(dfs5, dfs6, on = "Name", how = "inner")

     Name  Q1  Q2  Q3  Q4
0    Henk  75  65  62  66
1  Shanti  85  87  88  84
2   Shiva  76  69  72  74
3   Kumar  65  73  78  70

In [ ]:
pd.merge(dfs5, dfs6, on = "Name", how = "outer")

     Name    Q1    Q2    Q3    Q4
0    Henk  75.0  65.0  62.0  66.0
1  Shanti  85.0  87.0  88.0  84.0
2   Shiva  76.0  69.0  72.0  74.0
3   Kumar  65.0  73.0  78.0  70.0
4     SKY  77.0  69.0   NaN   NaN
5     SUN  81.0  82.0   NaN   NaN
6     AAA   NaN   NaN  67.0  78.0
7     BBB   NaN   NaN  71.0  77.0

In [ ]:
dfs5

     Name  Q1  Q2
0    Henk  75  65
1  Shanti  85  87
2   Shiva  76  69
3   Kumar  65  73
4     SKY  77  69
5     SUN  81  82

In [ ]:
dfs6

     Name  Q3  Q4
0    Henk  62  66
1  Shanti  88  84
2   Shiva  72  74
3   Kumar  78  70
4     AAA  67  78
5     BBB  71  77

In [ ]:
pd.merge(dfs5, dfs6, on = "Name", how = "left")

     Name  Q1  Q2    Q3    Q4
0    Henk  75  65  62.0  66.0
1  Shanti  85  87  88.0  84.0
2   Shiva  76  69  72.0  74.0
3   Kumar  65  73  78.0  70.0
4     SKY  77  69   NaN   NaN
5     SUN  81  82   NaN   NaN

In [ ]:
pd.merge(dfs5, dfs6, on = "Name", how = "right")

     Name    Q1    Q2  Q3  Q4
0    Henk  75.0  65.0  62  66
1  Shanti  85.0  87.0  88  84
2   Shiva  76.0  69.0  72  74
3   Kumar  65.0  73.0  78  70
4     AAA   NaN   NaN  67  78
5     BBB   NaN   NaN  71  77